[
  {
    "title": "Tell me about yourself",
    "answer": "A lot of jobs require someone who can think on their feet o present ideas with crispness and clarity. This question provides employers with an early preview of your core skills, your personality and your ability to respond to an unstructured question.",
    "category": "Common Questions"
  },
  {
    "title": "What is your greatest strength?",
    "answer": "Employers want to see if you can strike the right balance between confidence and humility. Hiring managers also want to get a sense for how self-aware and honest you are and align your strengths to the role at hand.",
    "category": "Common Questions"
  },
  {
    "title": "What is your greatest weakness?",
    "answer": "The interviewer is assessing whether your weaknesses will get in the way of doing the job. Employers are looking for humility and whether you’re committed to learning and growing. This is a place you can showcase what you’re doing to improve.",
    "category": "Common Questions"
  },
  {
    "title": "Why should we hire you?",
    "answer": "This question tests how persuasive you are. Interviewers want to see if you can make a calm, confident case for yourself, even if they’re acting skeptical. They’re looking for factual and compelling answers.",
    "category": "Common Questions"
  },
  {
    "title": "Why do you want to work here?",
    "answer": "Interviewers want to understand what prompted you to apply for this job. They don’t want candidates who are indifferent to where they work. Instead, they want someone who offers very specific reasons for why they want this job.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you showed leadership.",
    "answer": "Employers want to understand your capacity to step up and handle tough situations that undoubtedly arise in the workplace. They want to know when you’ve seen an opening to lean in and lead with good judgment.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you were successful on a team.",
    "answer": "If you can show that you’ve helped a team move through a challenge, you probably have strong communication and interpersonal skills. These kinds of “soft” skills are in high demand and make people successful in their jobs.",
    "category": "Common Questions"
  },
  {
    "title": "What would your co-workers say about you?",
    "answer": "Interviewers want to know if you’ll fit in with the team. This question can also help you highlight your strengths without feeling like you’re bragging.",
    "category": "Common Questions"
  },
  {
    "title": "Why do you want to leave your current role?",
    "answer": "Employers say they want to hire people who are running “to” a role as opposed to running “away.” However, they are also interested in your honesty when things haven’t worked out and will give people second chances when they demonstrate hunger.",
    "category": "Common Questions"
  },
  {
    "title": "Describe your most challenging project.",
    "answer": "Employers want to get a sense of what ‘challenging’ means to you. They also want to know how you handled the situation in a calm way. They’re looking for a storyline to prove that you can turn a bad story into a good story.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about something you’ve accomplished that you are proud of.",
    "answer": "This question assesses how you define professional success. If the story resonates, the employer will want you to do similar things at his or her company. You should focus on the impact and outcomes.",
    "category": "Common Questions"
  },
  {
    "title": "Can you explain your employment gap?",
    "answer": "This question isn’t designed to rule you out - it’s a good sign if you get the interview. Interviewers want to get more context about the gap and whether you’re still going to be a great fit for the role, despite the gap.",
    "category": "Common Questions"
  },
  {
    "title": "What are your salary expectations?",
    "answer": "If this question arises early, odds are that the interviewer is really asking: “Can we afford you?” If it arises much later, the interviewer may be hoping that your salary requirements are aligned to what they have budgeted for this role.",
    "category": "Common Questions"
  },
  {
    "title": "What do you like to do outside of work?",
    "answer": "Interviewers want to know you’re going to be enjoyable to have around and not just that you have the hard skills for the job. Use this question to set yourself up as interesting, fun, curious, or a go-getter.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to manage conflicting priorities.",
    "answer": "Employers want to see how you handle competing priorities, understand the implications of missing deadlines, and can stay cool under pressure.",
    "category": "Common Questions"
  },
  {
    "title": "Where do you see yourself in 5 years?",
    "answer": "Employers want to determine how serious you are about your career and whether your goals match the goals for this job. Employers don’t expect you to offer up a specific title you want. Instead, they want to know what you hope to accomplish.",
    "category": "Common Questions"
  },
  {
    "title": "Describe your leadership style.",
    "answer": "Good leaders can explain their values and priorities in a few words. This is a test to see if you can explain yourself. It also helps to determine whether your approach meshes with the company’s own culture.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you failed or made a mistake.",
    "answer": "Being able to admit to a mistake shows maturity and personal accountability. Employers want to know you’re self-aware and that you learn from past experiences. Errors are inevitable in any job - it’s how you handle them that matters.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you worked with a difficult person.",
    "answer": "Employers know that difficult people are everywhere and situations come up frequently. Explaining how you’ve been able to handle a challenging person in a mature way demonstrates your ability to manage difficult moments successfully.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to persuade someone.",
    "answer": "This question is all about sizing up your emotional intelligence. Interviewers are looking for problem solvers, not shouters. Strong answers showcase your listening skills and your ability to guide people to better choices.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you disagreed with someone.",
    "answer": "Occasional conflicts are a fact of life. Interviewers want to see if you can work through those tensions in a respectful way. If you helped steer things toward a good compromise, that’s a big plus. Signs of anger or bitterness will count against you.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you created a goal and achieved it.",
    "answer": "Strong answers reassure interviewers about your ambition and your determination to press ahead. Pick a trivial goal, and you’re at risk of being tagged as a slacker.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you surpassed people’s expectations.",
    "answer": "Employers want to know they are hiring high quality people. If you have a story about surpassing an expectation, you’ve probably gone above and beyond the call of duty and that’s a great thing!",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to handle pressure.",
    "answer": "Some jobs are high-stress and interviewers will test you to see if you can handle the heat. You’ll get partial credit for talking about your heroic efforts to get everything done, but you’ll get more points if you’ve enlisted allies.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to learn something quickly.",
    "answer": "Interviewers want more than a one-time success; they’re looking for signs of a well-tested strategy that helps you gather information and put it to use. They also want to know if you feel comfortable with rapid learning.",
    "category": "Common Questions"
  },
  {
    "title": "Do you have any questions for me?",
    "answer": "This question isn’t just designed to make sure you leave with all of your questions answered; it’s intended to see if you’re prepared and to assess how curious and thoughtful you are.",
    "category": "Common Questions"
  }
]
