[
  {
    "title": "Tell me about yourself",
    "answer": "A lot of jobs require someone who can think on their feet o present ideas with crispness and clarity. This question provides employers with an early preview of your core skills, your personality and your ability to respond to an unstructured question. \n\nSample answer: I’ve been shipping consumer devices for the past two decades. Over the years, I’ve built an expertise in firmware and bootloader designs. I’ve been lucky to have a few great mentors over the course of my career, and find a great deal of personal and professional satisfaction being able to do the same. I currently oversee a team of engineers and have helped grow several team members into managerial roles as well. Additionally, I like to stay active within the industry community and recently spoke at DeveloperWeek conference. I’ve been happy in my current role, have managed many successful product launches, and really enjoy management. I’d like to use my expertise to deliver more impact on a growing company — to help grow and shape team and culture —and make a significant impact in the market. \n\nWhy this answer worked well: The answer was a well-rounded snapshot of professional interests and strengths. It was clear that they’re active in the industry, and likely have a strong network. An interest in mentorship shows a willingness to invest time in the company, and energy into team members.",
    "category": "Common Questions"
  },
  {
    "title": "What is your greatest strength?",
    "answer": "Employers want to see if you can strike the right balance between confidence and humility. Hiring managers also want to get a sense for how self-aware and honest you are and align your strengths to the role at hand. \n\nSample Answer: What I bring to the team is a strong record in relationship building. I'm happiest when I'm engaging and strategizing about how we can help one another. I find that in sales, some people can be overly transactional. I think my superpower is in establishing more meaningful connections. I've gotten strong feedback in the past. One client said I was the best business development person he'd ever met. These types of connections have turned into big sales wins. For example, last year, I doubled my client base and outperformed my peers by 40%. And it's probably relevant to share that I started in that role without any contacts in the field. Today, there isn't a Fortune 100 company that doesn't know about the product I sold last. Why this answer worked well: She was specific and shared real numbers. She stayed relevant. The experience and the story all came together and she supported it all with numbers. Sample Answer: My greatest strength is that I am equally at ease when talking to executives, business users, and engineers. I come from an engineering background, but I have a very strong understanding of the business. This well-rounded view allows me to connect with colleagues from disparate departments and points of view quickly and authentically. I also have the ability to see the big, strategic picture, while not losing sight of the nuts and bolts. I can create and execute a strategy at a high level while also understanding the execution difficulties at an engineering level. Over the course of my career, I have found that many leaders generally do one or the other, and my ability to do both has proven to be advantageous to my projects and teams. By understanding the challenges from multiple angles, I’m able to connect dots and create solutions. This is evidenced by my track record of building and managing high performance teams. \n\nWhy this answer worked well: The candidate demonstrated the ability to understand the big pictures beyond his immediate area of expertise. The answer highlighted the candidate’s ability to contribute both at higher strategy level and at executive level.",
    "category": "Common Questions"
  },
  {
    "title": "What is your greatest weakness?",
    "answer": "The interviewer is assessing whether your weaknesses will get in the way of doing the job. Employers are looking for humility and whether you’re committed to learning and growing. This is a place you can showcase what you’re doing to improve. \n\nSample Answer: I have a strong desire to succeed, which generally serves me well. But I’ve realized that it can also be a blind spot if I’m not being honest with myself about what’s possible. A few years ago, I was working on a remote control, and the schedule was very tight. We were trying to go from concept to mass production in six months, and there was a high amount of pressure. I made the decision to continue with the factory build, even though my team was concerned that one of the parts we were using would fail. Because we had already spent $200,000 on the factory process, I pushed ahead. I was afraid to tell the program managers that we wouldn’t be able to hit our targets. Eventually, I was forced to — but I had already lost the company money. What I learned from this is the importance of being honest right up front and being realistic, even if it’s not the outcome I want. I’ve learned that failures can be turned around more easily when addressed quickly. Now I communicate status with program managers on a weekly basis. I always make them aware of the risks and what the impact might be. In the past four years, we haven't missed a single delivery. \n\nWhy this answer worked well: The answer provided an honest self-review with a clear example that took the interviewer through the decision-making process. The candidate took accountability and specific steps to prevent another issue.",
    "category": "Common Questions"
  },
  {
    "title": "Why should we hire you?",
    "answer": "This question tests how persuasive you are. Interviewers want to see if you can make a calm, confident case for yourself, even if they’re acting skeptical. They’re looking for factual and compelling answers. \n\nSample Answer: Having worked in strategy and sales roles across different geographies, I believe I am uniquely positioned to add a lot of value to this general managerial position. What separates me from most is my ability to take a holistic view of the business, set the vision, and translate that into a set of strong strategic solutions. Given my experience across different functions, I also have the ability to connect and influence cross-functional partners to drive business results, which I believe will be critical in this position. My background studying engineering and business taught me to balance the logic and data with the human side of things, which will be a competitive advantage in this ambiguous and dynamic industry. I’m motivated and excited to learn your company’s unique business model, and from my interactions with the employees here, I can see that we share values like respect, trust, and excellence. Overall, I believe I bring the right mix of skills, experiences and attitude for the job and think that my varied experience can add a lot of value here. \n\nWhy this answer worked well: The answer incorporated specific qualifications that set the candidate apart. Strengths were framed through the lens of how they could benefit the company.",
    "category": "Common Questions"
  },
  {
    "title": "Why do you want to work here?",
    "answer": "Interviewers want to understand what prompted you to apply for this job. They don’t want candidates who are indifferent to where they work. Instead, they want someone who offers very specific reasons for why they want this job. \n\nSample Answer: I understand that you’re looking for a leader who can implement and scale your data analytics platform. Over the course of my career, I have implemented data analytics platforms for 3 companies. Each had its own unique challenges and required me to learn, grow, and expand my skill set. I’m energized by new and complex challenges, and have the background, experience, and successful track record required to implement this system within your organization. The space in which your company operates is also of personal interest to me and I would love to contribute to it and help the company grow. When I started at my current company, I had a team of 4 people which I scaled to 28 people. I led the team in designing and building a big data platform for this big global company. Ultimately, we expanded the user base from 100 to 1,200. I’m looking forward to the next chapter and challenge, and believe I can bring real value to this organization. \n\nWhy this answer worked well: The answer detailed experience in helping growing organizations scale. It was clear that the candidate had personal interest in the company.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you showed leadership.",
    "answer": "Employers want to understand your capacity to step up and handle tough situations that undoubtedly arise in the workplace. They want to know when you’ve seen an opening to lean in and lead with good judgment. \n\nSample Answer: A few years ago, I took over the Web Operations team of a major company. This was a new area for me and when I stepped into the role, I immediately identified a clear need to completely rebuild 35 worldwide websites across eight different languages. I created a plan for the rebuild which included hiring additional technical writers, securing media agencies, acquiring new software, and more. This plan was meant to be enacted over 18 months but after I presented my plan to executive management, the CEO requested that we complete the project before the end of the year. This gave us just 12 months, which meant we had to rethink our project plan. The readjustment required the addition of even more resources and distributing the translation work to different teams — all while managing risk carefully. I am happy to say that after 12 months, the project was completed successfully, and team morale remained high throughout the process. \n\nWhy this answer worked well: The candidate demonstrated their ability to identify opportunity areas. The solution required a blend of soft and technical skills and the ability to lead cross-functional teams. The example also highlighted the ability to adjust a plan to meet aggressive deadlines.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you were successful on a team.",
    "answer": "If you can show that you’ve helped a team move through a challenge, you probably have strong communication and interpersonal skills. These kinds of “soft” skills are in high demand and make people successful in their jobs. \n\nSample Answer: As part of the developing a product roadmap for a CRM product line, I’m proud to have uncovered an unmet need during a user empathy session. One of the pain points that kept coming up was around the end customers spending too much time and effort in creating nested workflows for their activity-based marketing campaigns. I identified a way to do a rapid prototype of a ‘workflow’ module using natural language that can be invoked based on voice commands and keywords to create complex workflows. I demonstrated the idea and prototype to leadership to obtain support, then met with one of the key engineering leads to develop a timetable to develop this concept without risking the other features on the roadmap. In 2016, we filed a new patent in natural language processing. This capability can be a ‘plug-in’ module to several first party and third party software products that are focused on business process automation and workflows — which has generated a steady stream of licensing revenue to date. Why this answer worked well: The candidate highlighted their ability to discover opportunities and innovate new solutions. The success of the patent was a win for both customers and the company. Sample Answer: I joined a team 6 months after the MVP launch which was moderately successful, but short of management expectations. Without a real roadmap, the team was just running small experiments to drive incremental gains. I quickly realized that we’d need to do more than that to realize the long-term vision of the product. To gain the trust of my new team, I focused on what could be improved in the immediate future. I helped rationalize the short-term experiment roadmap, organized execution, removed roadblocks, and helped ship few of the high potential experiments. Concurrently, I spent time with the executive team to understand their expectations. After observing users and analyzing our logs, I partnered with team leads across Engineering, Design, and Research to develop an updated mission statement and a set of defined success metrics. Within 3 months, we were charging full-speed ahead with an updated roadmap, improvement operational metrics, and significant boost on a platform satisfaction survey. Two years later, the product had been used by hundreds of millions of people every month — 40 times the amount we started with. \n\nWhy this answer worked well: The candidate demonstrated their ability to identify areas of opportunity, backed up by quantifiable results. The answer included important soft skills like collaboration and team-building.",
    "category": "Common Questions"
  },
  {
    "title": "What would your co-workers say about you?",
    "answer": "Interviewers want to know if you’ll fit in with the team. This question can also help you highlight your strengths without feeling like you’re bragging. \n\nSample Answer: I would expect that most coworkers would describe me as driven. When I join teams or start on projects, I spend a lot of time understanding what’s most important about the work, which is a huge motivating factor for me. Once I lock in on what matters most, I share it with the team so we’re all invested with a common purpose. Being driven allows me to share what some have called my “infectious enthusiasm” with others and rally the team, and also means that I spend a lot of time with my work to make sure it’s done well. My teams have solid track records of hitting if not exceeding their goals because of this focus and ability to motivate. A good example was when I was working with quite a large group, and our project was given to us top-down. This didn’t feel empowering for the team, but I worked with leadership and our user research team to help the engineers and designers recognize the value of what we were working on. It was slated to be a multiyear project, but because the team was motivated and we focused on creating specifications for the product, we were able to deliver a prototype in just a few months. \n\nWhy this answer worked well: The answer painted a picture of a strong, motivating team member. The candidate detailed how their strength directly benefited their employer.",
    "category": "Common Questions"
  },
  {
    "title": "Why do you want to leave your current role?",
    "answer": "Employers say they want to hire people who are running “to” a role as opposed to running “away.” However, they are also interested in your honesty when things haven’t worked out and will give people second chances when they demonstrate hunger. \n\nSample Answer: I'm eager to find a new opportunity and grow. As you can see, I've been doing the same kind of work for two and a half years, and I'm starting to stagnate. My company doesn't have a role open for the next step up, unfortunately. So, I'm excited about the opportunity of becoming a sales manager at your company. The new role will let me use the skills I've developed in my current role like making cold calls; hooking in new clients with pithy-but-inspiring opening lines; following up with carefully crafted emails; listening to their pain points; and then offering up solutions that can solve their problems. I'm eager to make a fresh start, and I want to use my cold calling and listening skills to help craft an even better solution with the product I'd be working on in this new role. Why this answer worked well: She was positive and talked about her excitement about the new role. She did say she started to stagnate in her current role though, so she should tweak that language a bit to make it more favorable to them. She talked about using her current skills to gain new skills and experiences as a sales manager. She framed this in the context of the new role and the new job she's applying for. She should make it even more about how excited she is about the products—and selling them—for the company she's applying to. \n\nSample Answer: I’ve enjoyed my time with my current employer, and have grown a lot in my role. In the past 2 years, I’ve successfully shipped several products that turned out to be very successful. I believe that the next big trend for product development will be centered heavily around mobile shopping. My current company is looking at a possible move in this direction within a number of years, rather than months. I’m interested in joining your team because the products you’re developing are in the exact area I’d like to explore and grow. This role would give me an opportunity to build a solid understanding of complex problems and how to navigate through ambiguity, preparing me to adapt to new challenges quickly. I would also hone my data analytics skills, as I am already familiar with analyzing trends and insights in different customer segments and cohorts. And finally, I would strengthen my communication and leadership skills. As a product leader, it is super important to understand the resources, challenges, and priorities across the organization, and to drive synergy across teams. I love that your team is lean and fast-moving, and I believe that my product management skills, drive, and enthusiasm would make me a great fit for the organization. \n\nWhy this answer worked well: The candidate showed an ability to recognize industry trends and opportunities. The answer outlined a strong career vision. Skills were tied directly to the job description. ",
    "category": "Common Questions"
  },
  {
    "title": "Describe your most challenging project.",
    "answer": "Employers want to get a sense of what ‘challenging’ means to you. They also want to know how you handled the situation in a calm way. They’re looking for a storyline to prove that you can turn a bad story into a good story. \n\nSample Answer: I was tasked with implementing a uniform data platform for a large, multinational company with tens of thousands of employees. It had to be done in such a way that it could be used by teams spread out all over the world. There were several challenges associated with implementing a platform of this size and importance. We had to make sure the platform would be well-adopted, add value, and be approved by the executive team. Besides the technical complexities of building such a platform, this project was also challenging because we had to influence global teams. To accomplish this, I created a high-level strategy. Then, I asked Senior VPs to nominate reports to form one global team that could represent the entire organization. Ultimately, we succeeded in building a platform that was adopted globally, thanks to a strategic plan executed by a collaborative task force that incorporated both global needs and local aspirations. \n\nWhy this answer worked well: Leading a project of global scale demonstrates the ability to provide high-level strategy while being capable of localizing the executions. The candidate detailed the complications of the project and the action steps taken.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about something you’ve accomplished that you are proud of.",
    "answer": "This question assesses how you define professional success. If the story resonates, the employer will want you to do similar things at his or her company. You should focus on the impact and outcomes. \n\nSample Answer: In the last year, I led the launch of an entirely new e-commerce business channel within my company. Data showed us that users have a tendency to impulse buy on social media — and I saw an opportunity to embed a shopping feature in our social media app. With just a lean team of two analysts, I led a 6-month research project in which we interviewed 100 people on how they use social media, exploring their interest and intent when they saw a product image. I also had in-depth conversations with leaders of engineering, user research, and data scientists to understand what would be required to build this feature. Finally, we developed a cost analysis that detailed the resources and manpower we’d need to create a new division. The preparation and research provided a strong enough case to be approved at the highest levels of leadership. The company implemented this new business channel and revenue stream, and I’m really proud to have played a key role in a huge growth moment. \n\nWhy this answer worked well: The candidate demonstrated abilities to distill insights, identify key opportunity areas, and create actionable recommendations that led to new revenue streams. The answer included the detailed steps taken to execute a strategy.",
    "category": "Common Questions"
  },
  {
    "title": "Can you explain your employment gap?",
    "answer": "This question isn’t designed to rule you out - it’s a good sign if you get the interview. Interviewers want to get more context about the gap and whether you’re still going to be a great fit for the role, despite the gap. \n\nSample Answer: The 2-month gap on my resume was intentional. I wanted to leave space to prepare for a big international move and take the opportunity to travel. I’d been heads-down for much of my career, and this seemed like an ideal time to unplug. Unfortunately, due to Covid-19, I didn’t end up moving or traveling, and the new job fell through. I’ve used the time to brush up on my Spanish through online tutoring, practice some new recipes, and make my way through a reading list that’s relevant to my next role. I have also spent time thinking deeply about the contributions I’d like to make in the next chapter of my career and develop some concrete goals. Finally, I’ve been volunteering remotely with a London-based organization that I’m really excited about. The unexpected time off has given me a chance to reevaluate some priorities and goals, find inspiration, and recharge for my next move. \n\nWhy this answer worked well: The candidate showed the ability to be productive during an unstructured time. The answer detailed skills and learnings that may be beneficial to an employer.",
    "category": "Common Questions"
  },
  {
    "title": "What are your salary expectations?",
    "answer": "If this question arises early, odds are that the interviewer is really asking: “Can we afford you?” If it arises much later, the interviewer may be hoping that your salary requirements are aligned to what they have budgeted for this role. \n\nSample Answer: It’s important to me any new role is positive from a work standpoint. I want the work that I’d be doing to be impactful, and I want to know that I can contribute meaningfully to the organization. That’s why I’m most interested in this role: My personal values and ambitions are aligned with the company’s mission. As far as annual compensation, I’m open to how it is paid out, whether through base salary or a bonus structure. For a move to make sense to me, I would need the total compensation to be between [desired salary range]. Additionally, in future conversations, I’d also like to discuss how we might leverage the signing bonus to compensate for some of the long term Incentives like stock options that I’d be walking away from in my current role. Why this answer worked well: The answer offered a range instead of an exact figure, and suggested several ways that compensation could be structured. The candidate explained the value they’d like to offer the company, and expressed genuine interest in the role. Sample Answer: After researching market ranges from multiple sources online and taking into account my education, experience, and location, I’m targeting roles with base salaries in the range of [dollar amount]. Of course, I’m also taking into account opportunities for long-term growth with an emphasis on purpose-driven work as I evaluate and weigh options — and my values are closely aligned with your organization’s mission. For this reason, I would be willing to negotiate base salary in exchange for a generous time-off policy. I intend to be a high performing asset to your company, and value time to recharge when appropriate. \n\nWhy this answer worked well: The answer showed enthusiasm for the company and its mission. The candidate was prepared with a suggestion that would compensate for a lower base salary.",
    "category": "Common Questions"
  },
  {
    "title": "What do you like to do outside of work?",
    "answer": "Interviewers want to know you’re going to be enjoyable to have around and not just that you have the hard skills for the job. Use this question to set yourself up as interesting, fun, curious, or a go-getter. \n\nSample Answer: Outside of work, I enjoy fitness training, perfecting my golf swing, writing and recording music, and taking care of my dogs. This year I will be releasing my 4th album, which is all-instrumental, featuring classical guitar. I play every instrument and record tracks at my home office. Currently, two are streaming on iTunes and Amazon Music. I’m working towards a completion goal of late July. I find that music is a wonderful creative outlet and stress-reliever, as well as a perfect balance for my demanding career. It allows me to set personal goals and achieve them, which is also true of physical fitness. I’ve found that keeping my mind and body sharp improve every single facet of my life. Why this answer worked well: The candidate shows self awareness and self discipline.Hobbies are centered around wellness and creativity, both of which positively impact professional life. Sample Answer: I really love backpacking in different countries, especially with different cultures than the one I grew up in. I find that it allows me to disconnect and recharge from everyday life, while growing and learning something new. To date, I’ve backpacked either alone or with friends in over 20 countries, across Asia, South and Central America. For our honeymoon, my wife and I travelled northern India for 6 weeks. It’s a very diverse region, home to Hindus, Muslims, and Buddhists, and we really enjoyed spending time in a few different states. We did a diverse set of activities like hiking the Himalayas and Ladakh, finding cool hot springs, and Vipassana meditation. Vipassan is a 10 days of silence meditation. I’ve really connected with the technique and have found it to be a powerful way to focus my attention and reset myself. \n\nWhy this answer worked well: The candidate showed interest in learning from people with different backgrounds. The answer included hobbies centered around health and self-improvement.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to manage conflicting priorities.",
    "answer": "Employers want to see how you handle competing priorities, understand the implications of missing deadlines, and can stay cool under pressure. \n\nSample Answer: When I worked for a technology company in the 3D printing space, their org had me reporting directly to a VP of North American Sales, as well the global VP of Sales based in Tel Aviv. This dotted line structure led to inherent priority conflict, as I was taking direction from 2 different department heads with very different expectations. I was not able to perform my role effectively with multiple managers, and it caused much undue stress. I approached my direct manager of our North American operation and asked that he contact the VP of our corporate location in Israel to request a change in reporting structure. Fortunately, I had already established myself as a valuable, contributing team member. This allowed me to approach this escalation with confidence, as my manager knew I was committed to excellence in my role. It turned out that this was a much larger, company-wide issue, and by bringing my situation to the attention of leadership, a larger conversation about reporting structure began. Ultimately, the company made the decision to phase out the dotted line reporting matrix globally. \n\nWhy this answer worked well: The answer clearly explained the situation and source of conflict. The candidate had established themselves as a valuable contributor and felt comfortable addressing the issue directly. The resolution had positive implications for the entire company.",
    "category": "Common Questions"
  },
  {
    "title": "Where do you see yourself in 5 years?",
    "answer": "Employers want to determine how serious you are about your career and whether your goals match the goals for this job. Employers don’t expect you to offer up a specific title you want. Instead, they want to know what you hope to accomplish. \n\nSample Answer: In the first two or three years, I plan to immerse myself in the position by leveraging my strong Excel knowledge to develop automated reports and processes. The goal would be to improve efficiencies and reduce time spent on manual tasks. Within two to three years after that I see myself using that experience to help other departments develop similar efficiencies. Why this answer worked well: She broke it down into two-to-three year chunks. She explained what she could give in relation to her Excel skills rather than what she planned to get from the company. She avoided mentioning any job titles she hoped for in the future. Sample Answer: My professional experience has provided a strong foundation and invaluable insight into my strengths, interests, and areas of opportunity. In the next 5 years, my aim is to continue to build strong relationships and trust by establishing myself as an expert in my field. This will require dedicated investment both in and outside of my role, gathering new perspectives from partners, colleagues, and mentors. I plan to spend the next 2-3 years honing my leadership skills. I’m a fast learner and enthusiastic student of the industry. In each role, I have sought mentorship, and would like to provide this kind of support to others in the future. I have enjoyed owning projects and leading collaborators, and believe that management is the next right path for me. That’s just one reason why I’m drawn to your company. I’ve heard incredible things about your management training programs, and I am looking for an organization I can grow with. I believe that I have both the drive and the soft skills to be a real asset to your team for years to come. \n\nWhy this answer worked well: The candidate has a clear vision for their career and outlined how their goals can be an asset to the company. An interest in mentorship shows willingness to take guidance, as well as invest energy in others.",
    "category": "Common Questions"
  },
  {
    "title": "Describe your leadership style.",
    "answer": "Good leaders can explain their values and priorities in a few words. This is a test to see if you can explain yourself. It also helps to determine whether your approach meshes with the company’s own culture. \n\nSample Answer: For me, good leadership is about finding the best analytical approach while still caring about the people on the team. Last year, I took charge of a digital marketing campaign that wasn't getting any traction. I realized our team members didn't know what was expected. We worked together to build new metrics. I gave more responsibilities to our most engaged team member and helped another one find a different job where he could be more effective. Within three months, we were hitting our numbers and morale was vastly better. When we were ready to expand, five internal candidates asked if they could join our team. I love building productive, successful teams, and it sounds as if there would be great opportunities to do that in the job we're talking about. \n\nWhy this answer worked well: She talked about what her overall philosophy was and how she was an effective leader. She shared an example of something that was a challenge, what she did to solve it, how she brought the team along, and the results that she captured from it. She wrapped it up with how it connected back to the organization.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you failed or made a mistake.",
    "answer": "Being able to admit to a mistake shows maturity and personal accountability. Employers want to know you’re self-aware and that you learn from past experiences. Errors are inevitable in any job - it’s how you handle them that matters. \n\nSample Answer: In my first job, my manager asked me to develop several forms of tracking projects. I said “yes” because I wanted to do everything my manager asked me to do. But as I started working on the project, I realized I didn't understand the overall goal. And the project ended up creating templates that didn't meet my manager's expectations. My manager was disappointed in me. She told me that if I had asked some clarifying questions, I would've gotten to a better work product. I admitted to my manager that I had made a mistake and learned that it doesn't make you look stupid if you ask clarifying questions. I learned that it's better to speak up quickly. That's how I've handled those situations ever since. Why this answer worked well: She owned her mistake, going straight to the point and describing a situation with the right level of detail. She reflected on what she did wrong—not asking clarifying questions—and how that negatively impacted her work. She talked about what she learned from the experience. Sample Answer: As a second year digital executive at a leading snacks brand, I had an opportunity to either renew past sponsorships or seek new opportunities to associate our brand with top sports and entertainment properties. When I extended our contracts in fantasy football, I had my doubts of the effectiveness of the partnership and the overall lack of novelty after so many years. Compared to the actual NFL, fantasy football has a limited number of extremely dedicated fans and users. We had a true tradeoff of reach versus frequency. I worked with our agency partners to slash costs and develop numerous versions of compelling sweepstakes. We refreshed the creative constantly and monitored performance aggressively to avoid a negative ROI. But, despite all efforts, we struggled to get fans to engage. I wish I had trusted the numbers and my own intuition to consider other programs that would have been a much bigger success. It’s not easy to quickly acclimate at a top CPG company, but that experience taught me to bet on myself, seek mentors who can help guide me in a new culture, and never forget the importance of thanking teammates and partners for their hard work. \n\nWhy this answer worked well: The candidate took initiative to keep the work on track, but also owned the underperformance. The answer set up the challenge and detailed the range of strategies that were attempted.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you worked with a difficult person.",
    "answer": "Employers know that difficult people are everywhere and situations come up frequently. Explaining how you’ve been able to handle a challenging person in a mature way demonstrates your ability to manage difficult moments successfully. \n\nSample Answer: I don’t really believe that there are inherently difficult people. In my experience, different backgrounds and levels of information can make it difficult to understand another’s point of view. As a product manager, I really wanted to push for a shopping feature within our app. I saw a great opportunity to open a new potential revenue stream, but one of our key stakeholders — an engineering team lead — was concerned that we’d need to staff up in a significant way, and that the investment wouldn’t pay off. I did a little digging and spoke to his team members to understand his concerns better. I realized that I would need a quantitative analysis, rather than just a business plan. So I mapped out potential revenue to prove that this endeavor would not only be profitable in the short term, but over the next 5 years. He was impressed that I had run the same analytics as his engineering team would, which helped him move from a blocker to a strong advocate of the project. \n\nWhy this answer worked well: The candidate showed a willingness to work through a difficult relationship by understanding another point of view. The approach was a blend of soft and technical skills, and the result was a clear win for the company. Sample Answer:",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to persuade someone.",
    "answer": "This question is all about sizing up your emotional intelligence. Interviewers are looking for problem solvers, not shouters. Strong answers showcase your listening skills and your ability to guide people to better choices. \n\nSample Answer: As a software engineer, I had to persuade my marketing and sales teams that deploying a new version of the software was the right thing for our consumers and clients because the existing version was vulnerable to cyber attacks. The teams were against a new version because they believed it would cause client dissatisfaction. Additionally, these security enhancements came with a 23% cost increase. To reframe the value equation, I took three steps. First, I enrolled leading cyber attack experts to educate everyone on the impending risks from foreign entities. This reinforced the urgent business imperative of investing in secured systems. Next, I partnered with my finance team and determined that the cost of “fixing” systems after an attack amounted to a 77% increase in spend — to say nothing of intangibles like reputational damage. Finally, I hired a market research group to bring a group of 'non-techy' folks to conduct a live, in-person demo of our new interface. The group demonstrated the new software with ease. Marketing and sales were so convinced that they asked me to join them in key client meetings to lead the sales pitch myself. Clients not only loved the new system, but revenues increased by 32% with the development of a premium version. \n\nWhy this answer worked well: The answer clearly laid out the scenario, challenges, and steps. The candidate’s actions were a blend of strategic, cross-functional, and technical skills, resulting in quantifiable success.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you disagreed with someone.",
    "answer": "Occasional conflicts are a fact of life. Interviewers want to see if you can work through those tensions in a respectful way. If you helped steer things toward a good compromise, that’s a big plus. Signs of anger or bitterness will count against you. \n\nSample Answer: My organization had prioritized the growth of a certain part of the business, and we were all in a room discussing the best way to drive it. The cross-functional group had starkly different opinions. One senior level team member suggested that we “force” the customers to make necessary changes by threatening to pull funding. This set off warning sirens in my mind because my team would be responsible for carrying this out. I responded by acknowledging his idea as a novel approach. Then I mentioned that in the past I’d found it effective to offer incentives — rather than threats — to solve a problem or close a gap. I suggested that we offer the customer promotions in Q4 if they were able to execute our new strategy by Q3. I wanted to shift the conversation in a more positive direction and discuss ideas that would be mutually beneficial. It worked, and the group began to brainstorm which customer pain points we could help solve, and how we could inspire their cooperation. We ended up giving them additional incremental promotions, as well as participating in one of their corporate events. Not only did we solve their Q4 gap, but we grew our business by 2.3% that year. Why this answer worked well: The candidate demonstrated the ability to manage a potentially confrontational project by successfully aligning all stakeholders and guiding them towards an alternate solution. The solution offered was customer-centric, and still managed to increase the company’s bottom line. \n\nSample Answer: A few years ago, I was asked to give a presentation on best practices in procuring transportation. One of my suggestions was to change the lane hierarchy for which we procure rates as well as changing the hierarchy we used to build routing guides in our transportation management system. The Director of Transportation did not agree, which created some tension. I explained to the leadership team how the change would allow us to capture all the operational requirements and help carriers to know exactly where they are sending trucks. I quickly realized that the director was concerned that the change would require more personnel and thus more budget. So, I created a presentation to detail how the new plan could save up to 5%, which would help cover more than 2 additional temporary employees. That convinced the team. Ultimately, my plan did even better than expected, with a savings of 7% — approximately 34 million dollars. As a result, I was given more latitude on future procurement-related decisions, in which I employed target pricing and multi-year deals that saved the company even more. \n\nWhy this answer worked well: The answer laid out the challenge clearly and quantified success. The candidate demonstrated the ability to dive into stakeholders’ concerns and create consensus. The answer highlighted both soft and technical skills utilized to solve a conflict and improve the company’s bottom line.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you created a goal and achieved it.",
    "answer": "Strong answers reassure interviewers about your ambition and your determination to press ahead. Pick a trivial goal, and you’re at risk of being tagged as a slacker. \n\nSample Answer: I was two weeks into my first role with a new company when the leader of our business unit requested to showcase all the technology my team was working on, plus two brand new demos in the grand opening of our New York City office — in just six weeks. My manager tagged me to lead the charge. Most of our projects weren’t client-ready, which would mean lots of coding and testing to do in a short period of time. I don’t think anyone thought we’d have it 100% ready in time. I gathered the team and explained to them that we had a really cool opportunity, and asked for their ideas. I didn’t sugarcoat how hard it would be, but promised to do everything I could to clear the path. In the next few weeks, I quickly re-prioritized our Jira backlog to put other non-critical projects on pause and communicated to those stakeholders. I then implemented weekly sprints and daily standups to reduce meeting overhead and increase the time available for them to code and test in pairs. And to keep up morale, I requested funds from leadership to sponsor dinners for the team when they worked late, and even secured travel funds so that our developers could attend the opening. Through careful re-prioritization, open communication and keeping the morale high, we were able to successfully deliver the demo as the result. \n\nWhy this answer worked well:The candidate was realistic about the challenge, but created a clear plan to meet the timeline. The candidate demonstrated leadership by encouraging morale and securing a team reward.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you surpassed people’s expectations.",
    "answer": "Employers want to know they are hiring high quality people. If you have a story about surpassing an expectation, you’ve probably gone above and beyond the call of duty and that’s a great thing! \n\nSample Answer: I had been in my new role within the organization for just one week. My predecessor had left the relationship with our customer in a questionable place and as a result, they informed us that they’d be working with our top competitor instead. We’d found the work to be very impactful and needed a plan to win the customer back. I worked with my team to identify the customer’s pain points, then we began re-engagement efforts. At the beginning, the engagements were only by email, but soon I began getting phone calls from senior leaders asking if we could help them to solve these problems. After 7 months, the customer asked if we still had the headcount to support them. We came to discover that many of the presentations we’d shared had circulated through other parts of their organization. A few months later, the customer’s senior leadership asked me to expand my team so that we could increase our scope and do more of this work in other categories where we sold products. We did, and our sales have continued to grow in double digits for the last 2 years. Needless to say, the relationship with the customer is stronger than ever. \n\nWhy this answer worked well: The answer details how the candidate walked into a challenging situation, created a plan, and increased business as a result. The solution utilized a blend of customer relations, project management, and communication skills, which helped establish the candidate’s breadth of knowledge and professional competence.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to handle pressure.",
    "answer": "Some jobs are high-stress and interviewers will test you to see if you can handle the heat. You’ll get partial credit for talking about your heroic efforts to get everything done, but you’ll get more points if you’ve enlisted allies. \n\nSample Answer: During my time as an analyst for a major airline, I was pulled into a special project where we were asked to look at a potential merger scenario with another carrier. Due to the confidentiality of the project, I was unable to work with peers or use my normal channels for support, and was required to meet a demanding work schedule in order to complete our evaluation in the allotted time. While this project leveraged some of my existing skills, there was still a lot I needed to learn about our acquisition target to complete the work. I made my family aware that I’d need to temporarily shift my evening hours to work. This proactive communication prevented me from facing compounding pressure. I also made sure to communicate daily with my VP. He knew the unique challenge I was facing and could provide guidance, but only if he knew where to help. So I set up daily check-ins with him to show him my progress and receive feedback in a 1:1 setting outside of our normal working group. This added communication helped me avoid any surprises, eased stress, and allowed me to successfully manage and complete an unfamiliar project. \n\nWhy this answer worked well: The candidate demonstrated flexibility by being willing to deviate from a normal workflow. The candidate demonstrated the ability to learn new skills and processes quickly.",
    "category": "Common Questions"
  },
  {
    "title": "Tell me about a time you had to learn something quickly.",
    "answer": "Interviewers want more than a one-time success; they’re looking for signs of a well-tested strategy that helps you gather information and put it to use. They also want to know if you feel comfortable with rapid learning. \n\nSample Answer: When I started in my role, I thought I was quite good at Excel. I had told my employer that I knew how to calculate complex formulas, but I quickly discovered that my experience was well behind that of my peers. I didn’t want my boss to know that I was trailing in my capabilities just as I stepped into the new role, so I came up with a plan to teach myself everything I was missing. Every day after work, I watched at least an hour of Khan Academy videos. I also found practice worksheets online that allowed me to test myself and be sure I was mastering the content. Within three weeks, I was nearly as fast and fluent as my colleagues at work, and my boss never knew I had come in behind. \n\nWhy this answer worked well: She showed initiative by going above and beyond after work to catch up to her peers. She was specific in what she didn’t know and then told a clear and concise story about what she needed to do to change the situation. She described how with focus and hard work she was able to catch up rather quickly.",
    "category": "Common Questions"
  },
  {
    "title": "Do you have any questions for me?",
    "answer": "This question isn’t just designed to make sure you leave with all of your questions answered; it’s intended to see if you’re prepared and to assess how curious and thoughtful you are. \n\nSample Answer: I do have a few questions. Thanks for asking. We talked a bit about your plans to invest in training opportunities for your current employees, especially those who will be managing the company's transition to a centralized billing system. I think that this is a great plan, and I'd love to support the curriculum development. Now, will most of the training modules be designed by this team? And will they be delivered in person, via webinar, or a video format? Or will you be using a hybrid approach? Why this answer worked well: She showed that she had been paying attention to the conversation. She wanted to delve a bit further into a topic that they’ve just discussed. She conveyed a lot of enthusiasm about supporting what sounds like a priority project for that organization. Sample Answer: How do you think I should approach the first 30 days in the role to best position myself for success in a new culture? I know that your company has won numerous awards for workplace and community culture, and I have always prided myself in helping colleagues get active in the community. What do opportunities look like within your organization to get involved? \n\nWhy this answer worked well: The answer shows that the candidate has done their homework, and has a genuine interest in getting involved across different aspects of the company culture and activities. The candidate showed their desire to be successful in the role by already thinking about the onboarding process.",
    "category": "Common Questions"
  }
]
